modm-ext/archive-stmicro-svd/header_stm32f334c4t6.svd
        <register>
          <name>sTimerxRegs.3.PERxR</name>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.REPxR</name>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.CMP1xR</name>
          <addressOffset>0x21c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.CMP1CxR</name>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.CMP2xR</name>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.CMP3xR</name>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.CMP4xR</name>
          <addressOffset>0x22c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.CPT1xR</name>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.CPT2xR</name>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.DTxR</name>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.SETx1R</name>
          <addressOffset>0x23c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.RSTx1R</name>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.SETx2R</name>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.RSTx2R</name>
          <addressOffset>0x248</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.EEFxR1</name>
          <addressOffset>0x24c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.EEFxR2</name>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.RSTxR</name>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.CHPxR</name>
          <addressOffset>0x258</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.CPT1xCR</name>
          <addressOffset>0x25c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.CPT2xCR</name>
          <addressOffset>0x260</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.OUTxR</name>
          <addressOffset>0x264</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.FLTxR</name>
          <addressOffset>0x268</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.TIMxCR</name>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.TIMxISR</name>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.TIMxICR</name>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.TIMxDIER</name>
          <addressOffset>0x28c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.CNTxR</name>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.PERxR</name>
          <addressOffset>0x294</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.REPxR</name>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.CMP1xR</name>
          <addressOffset>0x29c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.CMP1CxR</name>
          <addressOffset>0x2a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.CMP2xR</name>
          <addressOffset>0x2a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.CMP3xR</name>
          <addressOffset>0x2a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.CMP4xR</name>
          <addressOffset>0x2ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.CPT1xR</name>
          <addressOffset>0x2b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.CPT2xR</name>
          <addressOffset>0x2b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.DTxR</name>
          <addressOffset>0x2b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.SETx1R</name>
          <addressOffset>0x2bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.RSTx1R</name>
          <addressOffset>0x2c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.SETx2R</name>
          <addressOffset>0x2c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.RSTx2R</name>
          <addressOffset>0x2c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.EEFxR1</name>
          <addressOffset>0x2cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.EEFxR2</name>
          <addressOffset>0x2d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.RSTxR</name>
          <addressOffset>0x2d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.CHPxR</name>
          <addressOffset>0x2d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.CPT1xCR</name>
          <addressOffset>0x2dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.CPT2xCR</name>
          <addressOffset>0x2e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.OUTxR</name>
          <addressOffset>0x2e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.4.FLTxR</name>
          <addressOffset>0x2e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CR1</name>
          <addressOffset>0x380</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MUDIS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAUDIS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TBUDIS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCUDIS</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TDUDIS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEUDIS</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC1USRC</name>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ADC2USRC</name>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ADC3USRC</name>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ADC4USRC</name>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x384</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MSWU</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TASWU</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TBSWU</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCSWU</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TDSWU</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TESWU</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MRST</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TARST</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TBRST</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCRST</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TDRST</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TERST</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <addressOffset>0x388</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FLT1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT2</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT3</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT4</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT5</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSFLT</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLLRDY</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BMPER</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x38c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FLT1C</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT2C</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT3C</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT4C</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT5C</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSFLTC</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLLRDYC</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BMPERC</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <addressOffset>0x390</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FLT1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT2</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT3</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT4</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT5</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSFLT</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLLRDY</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BMPER</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OENR</name>
          <addressOffset>0x394</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TA1OEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TA2OEN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TB1OEN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TB2OEN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC1OEN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC2OEN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TD1OEN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TD2OEN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TE1OEN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TE2OEN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ODISR</name>
          <addressOffset>0x398</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TA1ODIS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TA2ODIS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TB1ODIS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TB2ODIS</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC1ODIS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC2ODIS</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TD1ODIS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TD2ODIS</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TE1ODIS</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TE2ODIS</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ODSR</name>
          <addressOffset>0x39c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TA1ODS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TA2ODS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TB1ODS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TB2ODS</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC1ODS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC2ODS</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TD1ODS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TD2ODS</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TE1ODS</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TE2ODS</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BMCR</name>
          <addressOffset>0x3a0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BME</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BMOM</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BMCLK</name>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>BMPRSC</name>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>BMPREN</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTBM</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TABM</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TBBM</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCBM</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TDBM</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEBM</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BMSTAT</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
